#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<string.h>
#include<stdlib.h>

//数据的表现形式：   原码  反码 补码

//计算机的存储 一律补码 


void test01()
{
	char num = -15;
	 
	//原码 1000 1111
	//补码 1111 0001

	//有符号输出
	printf("%d\n", num); //-15

	//无符号输出
	//原码 1000 1111
	//补码 1111 0001     128 + 64 + 32 + 16 + 1 = 241

	printf("%u\n", num & 0x000000ff); //241 
	/*
	0000 0000 0000 0000 0000 0000 1111 0001 
	1111 1111 1111 1111 1111 1111 0000 0000  |
	1111 1111 1111 1111 1111 1111 1111 0001  &
	0000 0000 0000 0000 0000 0000 1111 1111  
	0000 0000 0000 0000 0000 0000 1111 0001	
	*/
}

void test02()
{
	char num = 0x9b;  // 1001  1011  补码 

	//有符号取
	// 补码 1001  1011
	// 原码 1110  0101   -（64 + 32 + 4 + 1） = - 101
	
	printf("%d\n", num);

	//无符号取
	printf("%x\n", num); //9b
	printf("%u\n", num & 0x000000ff); // 128 + 16 + 8 + 2 + 1 = 155
}

void test03()
{
	//char 取值范围
	//有符号   
	//     1111 1111 ~ 1000 0000    -   0000 0000 ~ 0111 1111
	//    -127   ~ -0                   0 ~ 127
	//    -0 看成 -128   
	//最终范围  -128 ~ 127  
	//无符号   0 ~255


	char num = 0xfe + 3;
	//1111 1110 
	//0000 0011 +
	// 1  0000 0001 只能保存8位 1 被踢掉
	// 0000 0001
	printf("%d\n", num);
	printf("%#x\n", num); //无符号 十六进制 取  0x1
	

	//-0是 -128
	char num1 = 0x80; // 1000 0000 // -0
	printf("%d\n", num1);

}

int main(){

	test01();

	system("pause");
	return EXIT_SUCCESS;
}